app/Models/DocumentModel.php

SELECT COUNT(*) AS `numrows`
FROM `documents`
WHERE `created_by` = 7
---
    public function countDocumentsByCreator(int $userId)
    {
        // Matches your 'created_by' column
        return $this->where('created_by', $userId)->countAllResults();