app/Models/OfficeModel.php

SELECT *
FROM `offices`
---
    public function getAllOffices(){
        return $this->findAll();